absen/app/Http/Controllers/SuperAdminController.php

select distinct `jenis`, `tanggal` from `absens` order by `tanggal` desc limit 5
select distinct `tanggal` from `absens` order by `tanggal` desc limit 6
select `jumlah`, `tanggal` from `counters` where `jenis` = 'ibadah1' and `tanggal` in ('2022-01-28', '2022-02-02', '2022-07-29', '2022-08-01', '2022-08-03', '2022-08-04')
select `jumlah`, `tanggal` from `counters` where `jenis` = 'ibadah2' and `tanggal` in ('2022-01-28', '2022-02-02', '2022-07-29', '2022-08-01', '2022-08-03', '2022-08-04')
---
    public function index(){
        $absens = Absen::select('jenis','tanggal')->orderBy('tanggal','DESC')->distinct('tanggal','jenis')->take('5')->get();
        $tanggalDB = Absen::select('tanggal')->distinct('tanggal')->orderBy('tanggal','DESC')->take('6')->get()->toArray();


        $this->selesaiProcess('ibadah1');
        $this->selesaiProcess('ibadah2');

        $arrayTanggal = array();


        foreach($tanggalDB as $dataTanggal){
            array_push($arrayTanggal,$dataTanggal['tanggal']);
        }
        sort($arrayTanggal);


        $ibadah1 = Counter::select('jumlah' , 'tanggal')->where('jenis' , 'ibadah1')->whereIn('tanggal' , $arrayTanggal)->get()->toJson();
        $jumlahIbadah1 = array();
        foreach(json_decode($ibadah1) as $data){
            array_push($jumlahIbadah1,$data->jumlah);
        }
        $ibadah2 =  Counter::select('jumlah' , 'tanggal')->where('jenis' , 'ibadah2')->whereIn('tanggal' , $arrayTanggal)->get()->toJson();

select `tanggal` from `absens` order by `created_at` desc limit 1
select count(distinct `user_id`) as aggregate from `absens` where `jenis` = 'ibadah1' and `tanggal` = '2022-08-04'
select exists(select * from `counters` where `jenis` = 'ibadah1' and `tanggal` = '2022-08-04') as `exists`
update `counters` set `jumlah` = 1, `counters`.`updated_at` = '2022-08-12 17:42:11' where `jenis` = 'ibadah1' and `tanggal` = '2022-08-04'
---
    public function selesaiProcess($jenis){
        try {
            //code...
            $getLastInserted = Absen::select("tanggal")->orderBy("created_at","desc")->first();
            if(!is_null($getLastInserted)){
                $getLastInserted->toArray();
            }
        } catch (\Throwable $th) {
            //throw $th;
            return false;
        }
        $count = Absen::where('jenis',$jenis)->where('tanggal',$getLastInserted['tanggal'])->distinct('user_id')->count();
        $checkCount = Counter::where('jenis',$jenis)->where('tanggal',$getLastInserted['tanggal'])->exists();

        if($checkCount == false){
            $data = new Counter;
            $data->jenis = $jenis;
            $data->tanggal = $getLastInserted['tanggal'];
            $data->jumlah = $count;

            $data->save();
        }
        else{
            $dataUpdate = array(
                'jumlah' => $count
            );
           Counter::where('jenis',$jenis)->where('tanggal',$getLastInserted['tanggal'])->update($dataUpdate);

select `id`, `name`, `nomor_telepon`, `alamat`, `kartu`, `foto`, `nama_panggilan` from `users` where `role` = 'user' order by `name` asc
---
    public function listjemaat(){
        $users = cache()->remember('users-key' ,60*60*24,function(){
            return User::where('role' , 'user')->select('id','name' , 'nomor_telepon' , 'alamat' , 'kartu' , 'foto' , 'nama_panggilan')->orderBy('name','asc')->get();
        });